package part3;

public class Reader {
//Визначити клас Reader, який зберігає таку інформацію про користувача бібліотеки: ПІБ, номер квитка читача, телефон
    String PIB;
    int nomerKvytka;
    int telephone;

    public static void main(String[] args) {
//Додати методи takeBooks(), returnBooks()
//takeBooks() прийматиме два параметри: кількість книг, які вже взяв читач, і кількість книг, які бере читач зараз
        takeBooks(){
            System.out.println("Читач "+ PIB + " взяв сьогодні " + n_книг +". Загалом читач взяв " + загальна сумма + " книг.");
        }
//returnBooks() прийматиме два параметри: кількість книг, які вже взяв читач, і кількість книг, які повертає читач зараз
        returnBooks() {
            int chytachVzyav = x;
            int chytachPovertae = y;
//Цей метод буде виводити в консоль запис у форматі "Читач Петров повернув сьогодні книг. Загалом в читача залишається загальна сумма книг."
            System.out.println("Читач "+PIB+" повернув сьогодні "+y+" книг. Загалом в читача залишається "+загальна сумма книг);
        }
    }
}
